{
  "common": {
    "welcome": "مرحبًا بك في تطبيق React الخاص بي",
    "signIn": "تسجيل الدخول",
    "signInWithClerk": "تسجيل الدخول باستخدام Clerk",
    "signInMessage": "يرجى تسجيل الدخول لعرض معلومات ملفك الشخصي.",
    "footer": "© {{year}} تطبيقي. جميع الحقوق محفوظة.",
    "hello": "مرحبًا!"
  },
  "navbar": {
    "selectLanguage": "اختر اللغة"
  },
  "sections": {
    "blockchainBasics": "أساسيات البلوكتشين والويب3",
    "userProfile": "الملف الشخصي للمستخدم",
    "web3Auth": "مصادقة الويب3"
  },
  "blockchainGuide": {
    "title": "دليل البلوكتشين والويب3",
    "intro": "هل أنت جديد في تقنية البلوكتشين؟ يشرح هذا الدليل المفاهيم الرئيسية بمصطلحات بسيطة لمساعدتك على فهم عالم الويب3 والعملات المشفرة والأصول الرقمية.",
    "selectTopic": "حدد موضوعًا أعلاه لمعرفة المزيد عنه",
    "evolving": "هذه التقنيات تتطور باستمرار! يقدم هذا الدليل شروحات أساسية لمساعدتك على البدء.",
    "close": "إغلاق",
    "topics": {
      "metamask": {
        "title": "MetaMask",
        "heading": "ما هو MetaMask؟",
        "description": "MetaMask هو مثل تطبيق محفظة رقمية لمتصفح الويب أو هاتفك المحمول. فكر فيه كمزيج من محفظة رقمية ومفتاح خاص يتيح لك الوصول إلى تطبيقات البلوكتشين.",
        "whatItDoes": "إليك ما يفعله MetaMask:",
        "items": [
          "يخزن عملاتك الرقمية (مثل الإيثيريوم)",
          "يربطك بمواقع الويب والتطبيقات المستندة إلى البلوكتشين",
          "يعمل كتسجيل دخولك لتطبيقات البلوكتشين (لا حاجة لأسماء المستخدمين/كلمات المرور!)"
        ],
        "comparison": "تمامًا كما قد تستخدم حساب Google أو Facebook للدخول إلى مواقع الويب المختلفة، يتيح لك MetaMask استخدام عنوان البلوكتشين الخاص بك للتفاعل مع تطبيقات وخدمات البلوكتشين."
      },
      "web3": {
        "title": "Web3",
        "heading": "ما هو Web3؟",
        "description": "Web3 هو الجيل التالي من الإنترنت الذي تم بناؤه باستخدام تقنية البلوكتشين. تم تصميمه ليكون أكثر انفتاحًا ولامركزية ويتحكم فيه المستخدم أكثر من الإنترنت الذي نستخدمه اليوم.",
        "comparison": "إليك كيف يختلف Web3 عن الإنترنت الحالي:",
        "items": [
          "<strong>Web1 (تسعينيات القرن العشرين):</strong> مواقع ويب للقراءة فقط. يمكنك فقط استهلاك المحتوى.",
          "<strong>Web2 (2000-الحاضر):</strong> مواقع ويب تفاعلية حيث يمكنك قراءة وإنشاء المحتوى، لكن الشركات الكبيرة تتحكم في بياناتك والمنصات (مثل Facebook، Google).",
          "<strong>Web3 (الناشئ):</strong> إنترنت حيث تمتلك بياناتك وأصولك الرقمية والمحتوى الخاص بك. لا تتحكم شركة واحدة في كل شيء، ويمكنك حمل هويتك الرقمية عبر تطبيقات مختلفة."
        ],
        "dapps": "غالبًا ما تسمى تطبيقات Web3 بـ \"dApps\" (التطبيقات اللامركزية) لأنها تعمل على شبكات لامركزية بدلاً من الخوادم المملوكة لشركة واحدة."
      },
      "ethereum": {
        "title": "Ethereum",
        "heading": "ما هو Ethereum؟",
        "description": "Ethereum هي منصة بلوكتشين تعمل مثل كمبيوتر عالمي لامركزي. بينما تم تصميم البيتكوين بشكل أساسي كعملة رقمية، تم إنشاء Ethereum للقيام بما هو أكثر من ذلك بكثير.",
        "keyThings": "أشياء رئيسية تحتاج إلى معرفتها عن Ethereum:",
        "items": [
          "لديها عملتها المشفرة الخاصة تسمى Ether (ETH)، والتي تستخدم لدفع المعاملات والخدمات على الشبكة",
          "تسمح للمطورين ببناء ونشر \"العقود الذكية\" — اتفاقيات ذاتية التنفيذ مع شروط مكتوبة مباشرة في الكود",
          "تدعم آلاف التطبيقات اللامركزية (dApps) في مجالات التمويل والفن والألعاب ووسائل التواصل الاجتماعي وغيرها"
        ],
        "platform": "فكر في Ethereum كمنصة تمكن أنواعًا جديدة من التطبيقات حيث لا تتحكم أي جهة واحدة — بدلاً من ذلك، يتم فرض القواعد من خلال التعليمات البرمجية التي تعمل على آلاف أجهزة الكمبيوتر حول العالم."
      },
      "evm": {
        "title": "EVM (آلة Ethereum الافتراضية)",
        "heading": "ما هي EVM؟",
        "description": "آلة Ethereum الافتراضية (EVM) هي المحرك الذي يشغل بلوكتشين Ethereum. إنها بيئة حوسبة خاصة تقوم بتشغيل العقود الذكية.",
        "understanding": "لفهم EVM:",
        "items": [
          "فكر فيها كجهاز كمبيوتر عملاق وعالمي موزع عبر آلاف الأجهزة الفردية",
          "تنفذ البرامج (العقود الذكية) بنفس الطريقة تمامًا على كل كمبيوتر في الشبكة",
          "تضمن أن العمليات قابلة للتنبؤ والتحقق ولا يمكن العبث بها"
        ],
        "importance": "EVM مهمة لأنها تخلق بيئة متسقة حيث يمكن للتطبيقات أن تعمل بدون ثقة — مما يعني أنك لا تحتاج إلى الثقة في أي شركة أو شخص لتنفيذ الكود بشكل صحيح، لأن الشبكة بأكملها تتحقق منه."
      },
      "defi": {
        "title": "DeFi (التمويل اللامركزي)",
        "heading": "ما هو DeFi؟",
        "description": "DeFi، أو التمويل اللامركزي، يعيد تصور الخدمات المالية باستخدام تقنية البلوكتشين بدلاً من البنوك والمؤسسات المالية التقليدية.",
        "allows": "تتيح لك تطبيقات DeFi:",
        "items": [
          "إقراض عملاتك المشفرة وكسب فائدة",
          "اقتراض العملات المشفرة باستخدام عملات مشفرة أخرى كضمان",
          "تداول العملات المشفرة بدون بورصة أو وسيط",
          "إنشاء حسابات تشبه التوفير بمعدلات فائدة أعلى عادة من البنوك التقليدية",
          "شراء التأمين والمشتقات والمنتجات المالية الأخرى"
        ],
        "difference": "الفرق الرئيسي هو أن DeFi يعمل بدون وسطاء. بدلاً من قيام البنك بالموافقة على معاملاتك ومعالجتها، تتولى العقود الذكية (الكود الآلي) كل شيء بناءً على قواعد محددة مسبقًا. هذا غالبًا ما يعني رسومًا أقل، ومعالجة أسرع، ووصولًا لأي شخص لديه اتصال بالإنترنت، بغض النظر عن موقعه أو خلفيته."
      },
      "nfts": {
        "title": "NFTs (الرموز غير القابلة للاستبدال)",
        "heading": "ما هي NFTs؟",
        "description": "NFTs (الرموز غير القابلة للاستبدال) هي عناصر رقمية فريدة تتم إدارة ملكيتها بواسطة البلوكتشين. فكر فيها كمقتنيات رقمية مع إثبات مدمج للأصالة والملكية.",
        "nonFungible": "\"غير قابل للاستبدال\" يعني ببساطة أن كل منها فريد ولا يمكن استبداله بعنصر آخر مطابق. هذا يختلف عن العملات المشفرة مثل البيتكوين حيث كل عملة متطابقة مع أخرى (قابلة للاستبدال).",
        "represent": "يمكن أن تمثل NFTs:",
        "items": [
          "الفن الرقمي والرسوم التوضيحية",
          "الموسيقى والفيديوهات",
          "الأراضي الافتراضية والعناصر في الألعاب",
          "تذاكر الفعاليات",
          "العضويات وتصاريح الوصول",
          "حتى تمثيلات للعناصر في العالم الحقيقي"
        ],
        "ownership": "عندما تمتلك NFT، تعمل البلوكتشين كسجل عام يثبت أنك مالك هذا العنصر الرقمي المحدد. يمكنك الاحتفاظ به، أو عرضه، أو بيعه لشخص آخر. غالبًا ما يستخدم الفنانون والمبدعون NFTs لبيع أعمالهم مباشرة للمعجبين دون الحاجة إلى المعارض أو وسطاء آخرين."
      }
    }
  },
  "metamaskSign": {
    "title": "توقيع رسالة باستخدام MetaMask",
    "walletConnection": "اتصال المحفظة",
    "connectedAccount": "الحساب المتصل:",
    "connect": "الاتصال بـ MetaMask",
    "connecting": "جاري الاتصال...",
    "messageToSign": "رسالة للتوقيع",
    "regenerate": "إعادة إنشاء الرسالة الافتراضية",
    "signButton": "توقيع الرسالة باستخدام MetaMask",
    "signing": "جاري التوقيع...",
    "signature": "التوقيع",
    "information": "تتيح لك هذه الميزة توقيع الرسائل باستخدام محفظة Ethereum الخاصة بك عبر MetaMask.",
    "verify": "يمكن استخدام التوقيع للتحقق من ملكيتك لعنوان المحفظة المتصلة.",
    "walletRequired": "محفظة Web3 مطلوبة",
    "metamaskNotInstalled": "MetaMask غير مثبت",
    "requiresMetamask": "تتطلب هذه الميزة MetaMask أو محفظة web3 متوافقة لتوقيع الرسائل.",
    "installMetamask": "تثبيت MetaMask",
    "afterInstalling": "بعد تثبيت MetaMask:",
    "steps": [
      "إنشاء أو استيراد محفظة",
      "الاتصال بشبكة Ethereum",
      "تحديث هذه الصفحة"
    ]
  },
  "userProfile": {
    "loading": "جاري تحميل الملف الشخصي...",
    "userNotFound": "لم يتم العثور على المستخدم",
    "email": "البريد الإلكتروني",
    "noEmail": "لم يتم تقديم بريد إلكتروني",
    "web3Wallet": "محفظة Web3",
    "noWallet": "لا توجد محفظة Web3 متصلة",
    "lastSignIn": "آخر تسجيل دخول",
    "never": "لم يتم تسجيل الدخول أبدًا",
    "invalidDate": "تاريخ غير صالح",
    "timeAgo": {
      "seconds": "منذ {{count}} ثانية",
      "seconds_plural": "منذ {{count}} ثوانٍ",
      "minutes": "منذ {{count}} دقيقة",
      "minutes_plural": "منذ {{count}} دقائق",
      "hours": "منذ {{count}} ساعة",
      "hours_plural": "منذ {{count}} ساعات",
      "days": "منذ {{count}} يوم",
      "days_plural": "منذ {{count}} أيام",
      "months": "منذ {{count}} شهر",
      "months_plural": "منذ {{count}} أشهر",
      "years": "منذ {{count}} سنة",
      "years_plural": "منذ {{count}} سنوات"
    }
  }
} 