{
  "common": {
    "welcome": "मेरे React ऐप में आपका स्वागत है",
    "signIn": "साइन इन करें",
    "signInWithClerk": "Clerk के साथ साइन इन करें",
    "signInMessage": "अपनी प्रोफ़ाइल जानकारी देखने के लिए कृपया साइन इन करें।",
    "footer": "© {{year}} मेरा ऐप। सर्वाधिकार सुरक्षित।",
    "hello": "नमस्ते!"
  },
  "navbar": {
    "selectLanguage": "भाषा चुनें"
  },
  "nav": {
    "home": "होम",
    "badges": "बैज"
  },
  "sections": {
    "blockchainBasics": "ब्लॉकचेन और वेब3 की मूल बातें",
    "userProfile": "उपयोगकर्ता प्रोफ़ाइल",
    "web3Auth": "वेब3 प्रमाणीकरण",
    "badges": "उपयोगकर्ता बैज"
  },
  "badges": {
    "title": "उपयोगकर्ता बैज",
    "noBadges": "अभी तक कोई बैज अर्जित नहीं किया है",
    "earned": "अर्जित",
    "available": "उपलब्ध",
    "all": "सभी बैज",
    "earnedDescription": "ये बैज आपकी उपलब्धियों और भागीदारी को दर्शाते हैं।",
    "availableDescription": "इन बैजों को अर्जित करने के लिए भाग लेना जारी रखें।",
    "allDescription": "हमारे प्लेटफॉर्म पर उपलब्ध सभी बैजों का अवलोकन।",
    "viewAll": "सभी बैज देखें",
    "signInToView": "अपने बैज देखने के लिए कृपया साइन इन करें",
    "keepParticipating": "इस बैज को अर्जित करने के लिए भाग लेना जारी रखें!",
    "noEarnedBadges": "आपने अभी तक कोई बैज अर्जित नहीं किया है। भाग लेना जारी रखें!",
    "noBadgesInCategory": "इस श्रेणी में कोई बैज नहीं है।",
    "showTestPanel": "टेस्ट पैनल दिखाएं",
    "hideTestPanel": "टेस्ट पैनल छिपाएं",
    "testPanel": "बैज टेस्ट पैनल",
    "testDescription": "यह पैनल आपको मैन्युअल रूप से बैज प्रदान करके और हटाकर बैज सिस्टम का परीक्षण करने की अनुमति देता है।",
    "availableBadges": "बैज प्रदान करें",
    "award": "प्रदान करें",
    "remove": "हटाएं"
  },
  "blockchainGuide": {
    "title": "ब्लॉकचेन और वेब3 गाइड",
    "intro": "ब्लॉकचेन तकनीक में नए हैं? यह गाइड आपको वेब3, क्रिप्टोकरेंसी और डिजिटल संपत्तियों की दुनिया को समझने में मदद करने के लिए सरल शब्दों में प्रमुख अवधारणाओं को समझाता है।",
    "selectTopic": "अधिक जानकारी के लिए ऊपर दिए गए विषय का चयन करें",
    "evolving": "ये तकनीकें लगातार विकसित हो रही हैं! यह गाइड आपको शुरू करने में मदद करने के लिए बुनियादी स्पष्टीकरण प्रदान करता है।",
    "close": "बंद करें",
    "topics": {
      "metamask": {
        "title": "MetaMask",
        "heading": "MetaMask क्या है?",
        "description": "MetaMask आपके वेब ब्राउज़र या मोबाइल फ़ोन के लिए डिजिटल वॉलेट ऐप की तरह है। इसे एक डिजिटल वॉलेट और एक विशेष कुंजी के संयोजन के रूप में सोचें जो आपको ब्लॉकचेन ऐप्स तक पहुंचने देता है।",
        "whatItDoes": "यहां बताया गया है कि MetaMask क्या करता है:",
        "items": [
          "आपकी डिजिटल मुद्राओं को स्टोर करता है (जैसे Ethereum)",
          "आपको ब्लॉकचेन-आधारित वेबसाइटों और ऐप्स से जोड़ता है",
          "ब्लॉकचेन एप्लिकेशन के लिए आपके लॉगिन के रूप में कार्य करता है (कोई उपयोगकर्ता नाम/पासवर्ड की आवश्यकता नहीं!)"
        ],
        "comparison": "जैसे आप विभिन्न वेबसाइटों में लॉग इन करने के लिए अपने Google या Facebook अकाउंट का उपयोग कर सकते हैं, MetaMask आपको ब्लॉकचेन ऐप्स और सेवाओं के साथ बातचीत करने के लिए अपने ब्लॉकचेन पते का उपयोग करने देता है।"
      },
      "web3": {
        "title": "Web3",
        "heading": "Web3 क्या है?",
        "description": "Web3 इंटरनेट की अगली पीढ़ी है जो ब्लॉकचेन तकनीक का उपयोग करके बनाई गई है। यह आज हम जिस इंटरनेट का उपयोग करते हैं, उससे अधिक खुला, विकेंद्रीकृत और उपयोगकर्ता-नियंत्रित होने के लिए डिज़ाइन किया गया है।",
        "comparison": "यहां बताया गया है कि Web3 वर्तमान इंटरनेट से कैसे भिन्न है:",
        "items": [
          "<strong>Web1 (1990 के दशक):</strong> केवल-पढ़ने वाली वेबसाइटें। आप केवल सामग्री का उपभोग कर सकते थे।",
          "<strong>Web2 (2000 के दशक-वर्तमान):</strong> इंटरैक्टिव वेबसाइटें जहां आप सामग्री को पढ़ और बना सकते हैं, लेकिन बड़ी कंपनियां आपके डेटा और प्लेटफॉर्म को नियंत्रित करती हैं (जैसे Facebook, Google)।",
          "<strong>Web3 (उभरता हुआ):</strong> एक ऐसा इंटरनेट जहां आप अपने डेटा, डिजिटल संपत्ति और सामग्री के मालिक हैं। कोई एकल कंपनी सब कुछ नियंत्रित नहीं करती है, और आप अपनी डिजिटल पहचान को विभिन्न अनुप्रयोगों में ले जा सकते हैं।"
        ],
        "dapps": "Web3 एप्लिकेशन को अक्सर \"dApps\" (विकेंद्रीकृत एप्लिकेशन) कहा जाता है क्योंकि वे एकल कंपनी के स्वामित्व वाले सर्वरों के बजाय विकेंद्रीकृत नेटवर्क पर चलते हैं।"
      },
      "ethereum": {
        "title": "Ethereum",
        "heading": "Ethereum क्या है?",
        "description": "Ethereum एक ब्लॉकचेन प्लेटफॉर्म है जो एक वैश्विक, विकेंद्रीकृत कंप्यूटर की तरह काम करता है। जबकि Bitcoin मुख्य रूप से डिजिटल मुद्रा के रूप में डिज़ाइन किया गया था, Ethereum को बहुत अधिक करने के लिए बनाया गया था।",
        "keyThings": "Ethereum के बारे में जानने के लिए महत्वपूर्ण बातें:",
        "items": [
          "इसकी अपनी क्रिप्टोकरेंसी है जिसे Ether (ETH) कहा जाता है, जिसका उपयोग नेटवर्क पर लेनदेन और सेवाओं के भुगतान के लिए किया जाता है",
          "यह डेवलपर्स को \"स्मार्ट कॉन्ट्रैक्ट्स\" - स्व-निष्पादित समझौते जिनकी शर्तें सीधे कोड में लिखी होती हैं - बनाने और तैनात करने की अनुमति देता है",
          "यह वित्त, कला, गेमिंग, सोशल मीडिया, और अधिक में हजारों विकेंद्रीकृत एप्लिकेशन (dApps) को शक्ति प्रदान करता है"
        ],
        "platform": "Ethereum को एक ऐसे प्लेटफॉर्म के रूप में सोचें जो नए प्रकार के एप्लिकेशन को सक्षम बनाता है जहां किसी एकल इकाई का नियंत्रण नहीं होता - इसके बजाय, नियम दुनिया भर में हजारों कंप्यूटरों पर चलने वाले कोड द्वारा लागू किए जाते हैं।"
      },
      "evm": {
        "title": "EVM (Ethereum वर्चुअल मशीन)",
        "heading": "EVM क्या है?",
        "description": "Ethereum वर्चुअल मशीन (EVM) वह इंजन है जो Ethereum ब्लॉकचेन को चलाता है। यह एक विशेष कंप्यूटिंग वातावरण है जो स्मार्ट कॉन्ट्रैक्ट्स चलाता है।",
        "understanding": "EVM को समझने के लिए:",
        "items": [
          "इसे हजारों व्यक्तिगत मशीनों पर फैले एक विशाल, वैश्विक कंप्यूटर के रूप में सोचें",
          "यह नेटवर्क में हर कंप्यूटर पर प्रोग्राम (स्मार्ट कॉन्ट्रैक्ट्स) को बिल्कुल एक ही तरीके से निष्पादित करता है",
          "यह सुनिश्चित करता है कि ऑपरेशन अनुमानित, सत्यापित हैं और इनमें छेड़छाड़ नहीं की जा सकती"
        ],
        "importance": "EVM महत्वपूर्ण है क्योंकि यह एक सुसंगत वातावरण बनाता है जहां एप्लिकेशन बिना विश्वास के चल सकते हैं - इसका मतलब है कि आपको कोड को सही ढंग से निष्पादित करने के लिए किसी एकल कंपनी या व्यक्ति पर भरोसा करने की आवश्यकता नहीं है, क्योंकि पूरा नेटवर्क इसे सत्यापित करता है।"
      },
      "defi": {
        "title": "DeFi (विकेंद्रीकृत वित्त)",
        "heading": "DeFi क्या है?",
        "description": "DeFi, या विकेंद्रीकृत वित्त, पारंपरिक बैंकों और वित्तीय संस्थानों के बजाय ब्लॉकचेन तकनीक का उपयोग करके वित्तीय सेवाओं की कल्पना को नया रूप देता है।",
        "allows": "DeFi एप्लिकेशन आपको अनुमति देते हैं:",
        "items": [
          "अपनी क्रिप्टो को उधार देकर ब्याज कमाएं",
          "अन्य क्रिप्टो को संपार्श्विक के रूप में उपयोग करके क्रिप्टो उधार लें",
          "बिना एक्सचेंज या ब्रोकर के क्रिप्टोकरेंसी का व्यापार करें",
          "पारंपरिक बैंकों की तुलना में आमतौर पर अधिक ब्याज दरों वाले बचत जैसे खाते बनाएं",
          "बीमा, डेरिवेटिव्स और अन्य वित्तीय उत्पादों को खरीदें"
        ],
        "difference": "मुख्य अंतर यह है कि DeFi बिना मध्यस्थों के काम करता है। बैंक द्वारा आपके लेनदेन को अनुमोदित और संसाधित करने के बजाय, स्मार्ट कॉन्ट्रैक्ट्स (स्वचालित कोड) पूर्व-निर्धारित नियमों के आधार पर सब कुछ संभालते हैं। इसका अर्थ अक्सर कम शुल्क, तेज़ प्रसंस्करण और इंटरनेट कनेक्शन वाले किसी भी व्यक्ति के लिए पहुंच होता है, चाहे उनका स्थान या पृष्ठभूमि कुछ भी हो।"
      },
      "nfts": {
        "title": "NFTs (नॉन-फंजिबल टोकन)",
        "heading": "NFTs क्या हैं?",
        "description": "NFTs (नॉन-फंजिबल टोकन) ब्लॉकचेन-प्रबंधित स्वामित्व वाले अद्वितीय डिजिटल आइटम हैं। उन्हें प्रामाणिकता और स्वामित्व के बिल्ट-इन प्रमाण के साथ डिजिटल संग्रहणीय वस्तुओं के रूप में सोचें।",
        "nonFungible": "\"नॉन-फंजिबल\" का अर्थ है कि प्रत्येक अद्वितीय है और इसे किसी अन्य समान वस्तु से प्रतिस्थापित नहीं किया जा सकता। यह Bitcoin जैसी क्रिप्टोकरेंसी से अलग है जहां प्रत्येक सिक्का दूसरे के समान होता है (फंजिबल)।",
        "represent": "NFTs प्रतिनिधित्व कर सकते हैं:",
        "items": [
          "डिजिटल कला और चित्रण",
          "संगीत और वीडियो",
          "गेम में आभासी भूमि और वस्तुएं",
          "कार्यक्रमों के टिकट",
          "सदस्यता और पहुंच पास",
          "यहां तक कि वास्तविक दुनिया की वस्तुओं का प्रतिनिधित्व"
        ],
        "ownership": "जब आप एक NFT के मालिक होते हैं, तो ब्लॉकचेन एक सार्वजनिक रिकॉर्ड के रूप में काम करता है जो साबित करता है कि आप उस विशिष्ट डिजिटल आइटम के मालिक हैं। आप इसे रख सकते हैं, प्रदर्शित कर सकते हैं, या किसी और को बेच सकते हैं। कलाकार और निर्माता अक्सर अपने काम को गैलरी या अन्य मध्यस्थों की आवश्यकता के बिना सीधे प्रशंसकों को बेचने के लिए NFTs का उपयोग करते हैं।"
      }
    }
  },
  "metamaskSign": {
    "title": "MetaMask के साथ संदेश पर हस्ताक्षर करें",
    "walletConnection": "वॉलेट कनेक्शन",
    "connectedAccount": "कनेक्टेड अकाउंट:",
    "connect": "MetaMask कनेक्ट करें",
    "connecting": "कनेक्ट हो रहा है...",
    "messageToSign": "हस्ताक्षर करने के लिए संदेश",
    "messagePlaceholder": "हस्ताक्षर करने के लिए एक संदेश दर्ज करें",
    "regenerate": "डिफ़ॉल्ट संदेश पुनः जनरेट करें",
    "signButton": "MetaMask के साथ संदेश पर हस्ताक्षर करें",
    "signing": "हस्ताक्षर कर रहा है...",
    "signature": "हस्ताक्षर",
    "information": "यह सुविधा आपको MetaMask के माध्यम से अपने Ethereum वॉलेट से संदेशों पर हस्ताक्षर करने की अनुमति देती है।",
    "verify": "हस्ताक्षर का उपयोग कनेक्टेड वॉलेट एड्रेस के आपके स्वामित्व को सत्यापित करने के लिए किया जा सकता है।",
    "walletRequired": "Web3 वॉलेट आवश्यक है",
    "metamaskNotInstalled": "MetaMask इंस्टॉल नहीं है",
    "requiresMetamask": "इस सुविधा के लिए संदेशों पर हस्ताक्षर करने के लिए MetaMask या संगत web3 वॉलेट की आवश्यकता है।",
    "installMetamask": "MetaMask इंस्टॉल करें",
    "afterInstalling": "MetaMask इंस्टॉल करने के बाद:",
    "steps": [
      "वॉलेट बनाएं या इंपोर्ट करें",
      "Ethereum नेटवर्क से कनेक्ट करें",
      "इस पेज को रिफ्रेश करें"
    ]
  },
  "userProfile": {
    "loading": "प्रोफ़ाइल लोड हो रही है...",
    "userNotFound": "उपयोगकर्ता नहीं मिला",
    "email": "ईमेल",
    "noEmail": "कोई ईमेल प्रदान नहीं किया गया",
    "web3Wallet": "Web3 वॉलेट",
    "noWallet": "कोई Web3 वॉलेट कनेक्ट नहीं है",
    "lastSignIn": "अंतिम साइन इन",
    "never": "कभी साइन इन नहीं किया",
    "invalidDate": "अमान्य तिथि",
    "timeAgo": {
      "seconds": "{{count}} सेकंड पहले",
      "seconds_plural": "{{count}} सेकंड पहले",
      "minutes": "{{count}} मिनट पहले",
      "minutes_plural": "{{count}} मिनट पहले",
      "hours": "{{count}} घंटे पहले",
      "hours_plural": "{{count}} घंटे पहले",
      "days": "{{count}} दिन पहले",
      "days_plural": "{{count}} दिन पहले",
      "months": "{{count}} महीने पहले",
      "months_plural": "{{count}} महीने पहले",
      "years": "{{count}} साल पहले",
      "years_plural": "{{count}} साल पहले"
    }
  }
} 