{
  "common": {
    "welcome": "Ласкаво просимо до Мого React Додатку",
    "signIn": "Увійти",
    "signInWithClerk": "Увійти через Clerk",
    "signInMessage": "Будь ласка, увійдіть, щоб переглянути інформацію свого профілю.",
    "footer": "© {{year}} Мій Додаток. Усі права захищені.",
    "hello": "Привіт!"
  },
  "navbar": {
    "selectLanguage": "Вибрати мову"
  },
  "nav": {
    "home": "Головна",
    "badges": "Значки"
  },
  "sections": {
    "blockchainBasics": "Основи Блокчейну та Web3",
    "userProfile": "Профіль Користувача",
    "web3Auth": "Web3 Аутентифікація",
    "badges": "Значки Користувача"
  },
  "badges": {
    "title": "Значки Користувача",
    "noBadges": "Ще не отримано жодного значка",
    "earned": "Отримані",
    "available": "Доступні",
    "all": "Усі Значки",
    "earnedDescription": "Ці значки відзначають ваші досягнення та участь.",
    "availableDescription": "Продовжуйте брати участь, щоб отримати ці значки.",
    "allDescription": "Огляд усіх значків, доступних на нашій платформі.",
    "viewAll": "Переглянути всі значки",
    "signInToView": "Будь ласка, увійдіть, щоб переглянути свої значки",
    "keepParticipating": "Продовжуйте брати участь, щоб отримати цей значок!",
    "noEarnedBadges": "Ви ще не отримали жодного значка. Продовжуйте брати участь!",
    "noBadgesInCategory": "У цій категорії немає значків.",
    "showTestPanel": "Показати Тестову Панель",
    "hideTestPanel": "Сховати Тестову Панель",
    "testPanel": "Тестова Панель Значків",
    "testDescription": "Ця панель дозволяє тестувати систему значків шляхом видачі та видалення значків вручну.",
    "availableBadges": "Видати Значки",
    "award": "Видати",
    "remove": "Видалити"
  },
  "blockchainGuide": {
    "title": "Посібник з Blockchain і Web3",
    "intro": "Ви новачок у технології блокчейн? Цей посібник пояснює ключові концепції простими термінами, щоб допомогти вам зрозуміти світ Web3, криптовалют та цифрових активів.",
    "selectTopic": "Виберіть тему вище, щоб дізнатися більше",
    "evolving": "Ці технології постійно розвиваються! Цей посібник надає базові пояснення, щоб допомогти вам почати.",
    "close": "Закрити",
    "topics": {
      "metamask": {
        "title": "MetaMask",
        "heading": "Що таке MetaMask?",
        "description": "MetaMask — це як додаток цифрового гаманця для вашого веб-браузера або мобільного телефону. Думайте про нього як про комбінацію цифрового гаманця та спеціального ключа, який дозволяє вам отримати доступ до додатків блокчейну.",
        "whatItDoes": "Ось що робить MetaMask:",
        "items": [
          "Зберігає ваші цифрові валюти (як Ethereum)",
          "Підключає вас до веб-сайтів та додатків на основі блокчейну",
          "Діє як ваш логін для додатків блокчейну (не потрібні імена користувачів/паролі!)"
        ],
        "comparison": "Подібно до того, як ви можете використовувати свій обліковий запис Google або Facebook для входу на різні веб-сайти, MetaMask дозволяє використовувати вашу адресу блокчейну для взаємодії з додатками та послугами блокчейну."
      },
      "web3": {
        "title": "Web3",
        "heading": "Що таке Web3?",
        "description": "Web3 — це наступне покоління інтернету, яке побудоване з використанням технології блокчейн. Він розроблений, щоб бути більш відкритим, децентралізованим і контрольованим користувачем, ніж інтернет, який ми використовуємо сьогодні.",
        "comparison": "Ось чим Web3 відрізняється від поточного інтернету:",
        "items": [
          "<strong>Web1 (1990-ті):</strong> Веб-сайти тільки для читання. Ви могли лише споживати контент.",
          "<strong>Web2 (2000-ті-нині):</strong> Інтерактивні веб-сайти, де ви можете як читати, так і створювати контент, але великі компанії контролюють ваші дані та платформи (такі як Facebook, Google).",
          "<strong>Web3 (що розвивається):</strong> Інтернет, де ви володієте своїми даними, цифровими активами та контентом. Жодна компанія не контролює все, і ви можете переносити свою цифрову ідентичність між різними додатками."
        ],
        "dapps": "Додатки Web3 часто називають \"dApps\" (децентралізовані додатки), тому що вони працюють у децентралізованих мережах, а не на серверах, що належать одній компанії."
      },
      "ethereum": {
        "title": "Ethereum",
        "heading": "Що таке Ethereum?",
        "description": "Ethereum — це блокчейн-платформа, яка працює як глобальний, децентралізований комп'ютер. У той час як Bitcoin був розроблений в основному як цифрова валюта, Ethereum був створений для того, щоб робити набагато більше.",
        "keyThings": "Ключові речі, які варто знати про Ethereum:",
        "items": [
          "Він має власну криптовалюту під назвою Ether (ETH), яка використовується для оплати транзакцій та послуг у мережі",
          "Він дозволяє розробникам будувати та розгортати \"розумні контракти\" — самовиконувані угоди з умовами, безпосередньо записаними в коді",
          "Він підтримує тисячі децентралізованих додатків (dApps) у фінансах, мистецтві, іграх, соціальних медіа тощо"
        ],
        "platform": "Думайте про Ethereum як про платформу, яка дозволяє нові види додатків, де жоден окремий суб'єкт не має контролю — замість цього, правила виконуються кодом, що працює на тисячах комп'ютерів по всьому світу."
      },
      "evm": {
        "title": "EVM (Ethereum Virtual Machine)",
        "heading": "Що таке EVM?",
        "description": "Ethereum Virtual Machine (EVM) — це двигун, який живить блокчейн Ethereum. Це спеціальне обчислювальне середовище, яке виконує розумні контракти.",
        "understanding": "Щоб зрозуміти EVM:",
        "items": [
          "Думайте про нього як про гігантський, глобальний комп'ютер, розподілений на тисячах окремих машин",
          "Він виконує програми (розумні контракти) точно однаково на кожному комп'ютері в мережі",
          "Він забезпечує, що операції є передбачуваними, перевірюваними і не можуть бути підроблені"
        ],
        "importance": "EVM важливий, тому що він створює послідовне середовище, де додатки можуть працювати без довіри — це означає, що вам не потрібно довіряти жодній компанії чи особі для правильного виконання коду, оскільки вся мережа перевіряє його."
      },
      "defi": {
        "title": "DeFi (Децентралізовані Фінанси)",
        "heading": "Що таке DeFi?",
        "description": "DeFi, або Децентралізовані Фінанси, переосмислює фінансові послуги, використовуючи технологію блокчейн замість традиційних банків та фінансових установ.",
        "allows": "Додатки DeFi дозволяють вам:",
        "items": [
          "Позичати свою криптовалюту та заробляти відсотки",
          "Позичати криптовалюту, використовуючи іншу криптовалюту як заставу",
          "Торгувати криптовалютами без біржі або брокера",
          "Створювати рахунки, схожі на ощадні, з зазвичай вищими процентними ставками, ніж у традиційних банках",
          "Купувати страховки, деривативи та інші фінансові продукти"
        ],
        "difference": "Ключова відмінність полягає в тому, що DeFi працює без посередників. Замість того, щоб банк схвалював і обробляв ваші транзакції, розумні контракти (автоматизований код) обробляють все на основі попередньо визначених правил. Це часто означає нижчі збори, швидшу обробку та доступ для будь-кого з підключенням до інтернету, незалежно від їхнього місцезнаходження чи походження."
      },
      "nfts": {
        "title": "NFT (Незамінні Токени)",
        "heading": "Що таке NFT?",
        "description": "NFT (Незамінні Токени) — це унікальні цифрові елементи з управлінням власністю через блокчейн. Думайте про них як про цифрові колекційні предмети з вбудованим доказом автентичності та власності.",
        "nonFungible": "\"Незамінний\" просто означає, що кожен з них є унікальним і не може бути замінений іншим ідентичним елементом. Це відрізняється від криптовалют, таких як Bitcoin, де кожна монета ідентична іншій (замінна).",
        "represent": "NFT можуть представляти:",
        "items": [
          "Цифрове мистецтво та ілюстрації",
          "Музику та відео",
          "Віртуальні землі та предмети в іграх",
          "Квитки на події",
          "Членства та перепустки доступу",
          "Навіть представлення реальних предметів"
        ],
        "ownership": "Коли ви володієте NFT, блокчейн служить публічним записом, що доводить, що ви є власником цього конкретного цифрового елемента. Ви можете зберігати його, демонструвати або продавати комусь іншому. Художники та творці часто використовують NFT для продажу своїх робіт безпосередньо шанувальникам без потреби в галереях чи інших посередниках."
      }
    }
  },
  "metamaskSign": {
    "title": "Підписати Повідомлення з MetaMask",
    "walletConnection": "Підключення Гаманця",
    "connectedAccount": "Підключений Акаунт:",
    "connect": "Підключити MetaMask",
    "connecting": "Підключення...",
    "messageToSign": "Повідомлення для Підпису",
    "regenerate": "Перегенерувати Стандартне Повідомлення",
    "signButton": "Підписати Повідомлення з MetaMask",
    "signing": "Підписання...",
    "signature": "Підпис",
    "information": "Ця функція дозволяє вам підписувати повідомлення за допомогою вашого гаманця Ethereum через MetaMask.",
    "verify": "Підпис можна використовувати для перевірки вашого володіння підключеною адресою гаманця.",
    "walletRequired": "Потрібен Гаманець Web3",
    "metamaskNotInstalled": "MetaMask не встановлено",
    "requiresMetamask": "Ця функція вимагає MetaMask або сумісний web3 гаманець для підписання повідомлень.",
    "installMetamask": "Встановити MetaMask",
    "afterInstalling": "Після встановлення MetaMask:",
    "steps": [
      "Створіть або імпортуйте гаманець",
      "Підключіться до мережі Ethereum",
      "Оновіть цю сторінку"
    ]
  },
  "userProfile": {
    "loading": "Завантаження профілю...",
    "userNotFound": "Користувач не знайдений",
    "email": "Електронна пошта",
    "noEmail": "Електронна пошта не надана",
    "web3Wallet": "Web3 Гаманець",
    "noWallet": "Web3 гаманець не підключено",
    "lastSignIn": "Останній Вхід",
    "never": "Ніколи не входив",
    "invalidDate": "Недійсна дата",
    "timeAgo": {
      "seconds": "{{count}} секунду тому",
      "seconds_plural": "{{count}} секунд тому",
      "minutes": "{{count}} хвилину тому",
      "minutes_plural": "{{count}} хвилин тому",
      "hours": "{{count}} годину тому",
      "hours_plural": "{{count}} годин тому",
      "days": "{{count}} день тому",
      "days_plural": "{{count}} днів тому",
      "months": "{{count}} місяць тому",
      "months_plural": "{{count}} місяців тому",
      "years": "{{count}} рік тому",
      "years_plural": "{{count}} років тому"
    }
  }
} 